In [1]:
#Data.csv

**Step 1: Importing the libraries**

In [2]:
import pandas as pd
import numpy as np

**Step 2: Importing dataset**

In [3]:
df=pd.read_csv(r"C:\Users\amanm\OneDrive\Desktop\assignment\Data.csv")
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Step 3: Encoding categorical data**

In [4]:
from sklearn.preprocessing import OneHotEncoder

In [5]:
oh_enc = OneHotEncoder(sparse=False,)

In [6]:
oh_enc_arr = oh_enc.fit_transform(df[["Country","Purchased"]])
oh_enc_arr

array([[1., 0., 0., 1., 0.],
       [0., 0., 1., 0., 1.],
       [0., 1., 0., 1., 0.],
       [0., 0., 1., 1., 0.],
       [0., 1., 0., 0., 1.],
       [1., 0., 0., 0., 1.],
       [0., 0., 1., 1., 0.],
       [1., 0., 0., 0., 1.],
       [0., 1., 0., 1., 0.],
       [1., 0., 0., 0., 1.]])

**Step 4: Creating a dummy variable**

In [7]:
def change_coountry(x):
    if x=="France":
        return 1
    if x=="Spain":
        return 0
    if x=="Germany":
        return 2

In [8]:
def change_Puchased(x):
    if x=="Yes":
        return 1
    if x=="No":
        return 0

In [9]:
df["CountryNew"]=df["Country"].apply(change_coountry)

In [10]:
df["PurchasedNew"]=df["Purchased"].apply(change_Puchased)
df

   Country   Age   Salary Purchased  CountryNew  PurchasedNew
0   France  44.0  72000.0        No           1             0
1    Spain  27.0  48000.0       Yes           0             1
2  Germany  30.0  54000.0        No           2             0
3    Spain  38.0  61000.0        No           0             0
4  Germany  40.0      NaN       Yes           2             1
5   France  35.0  58000.0       Yes           1             1
6    Spain   NaN  52000.0        No           0             0
7   France  48.0  79000.0       Yes           1             1
8  Germany  50.0  83000.0        No           2             0
9   France  37.0  67000.0       Yes           1             1

**Step 6: Splitting the datasets into training sets and Test sets**

In [11]:
X=df.loc[:,["Salary","CountryNew","Age"]]
y=df.loc[:,"PurchasedNew"]

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=1, random_state=5)

**Step 7: Feature Scaling**

In [13]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
sc.fit(X_train)
X_train = sc.transform(X_train)
X_test = sc.transform(X_test)